Emacs.org
#+TITLE: Literate Emacs Config
#+AUTHOR: Jake Shilling
#+EMAIL: shilling.jake@gmail.com
#+PROPERTY: header-args :tangle ./.config/emacs/init.el

* Header
#+begin_src emacs-lisp
;;; init.el --- Initialization -*- lexical-binding: t -*-
;;;
;;; Commentary:
;;;
;;;
;;; Code:
#+end_src

* General Utilities
** Path Functions

I use these functions to place files outside of =user-emacs-directory=. Generally, I think of state files as ones that =no-littering= would put into =etc= and cache files as the ones that would be =var=. That leaves the main =user-emacs-directory= free to only hold files that would be checked into the =dotfiles= repo.

#+begin_src emacs-lisp
(require 'xdg)
(require 'seq)

(defun init--parts-to-path (&rest args)
  (seq-reduce (lambda (acc part)
                (expand-file-name part acc))
              args
              default-directory))

(defun init--state-file (&rest args)
  (apply #'init--parts-to-path (xdg-state-home) "emacs" args))

(defun init--cache-file (&rest args)
  (apply #'init--parts-to-path (xdg-cache-home) "emacs" args))
#+end_src
** Basic System Info

These were copied straight out of Doom a while back.

#+begin_src emacs-lisp
(defconst IS-MAC     (eq system-type 'darwin))
(defconst IS-LINUX   (eq system-type 'gnu/linux))
(defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
(defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))
(defconst IS-WSL     (and IS-LINUX
                          (string-match-p "Microsoft"
                                          (shell-command-to-string "uname -a"))))
#+end_src
* Package Management
** Straight

Keep straight out of =user-emacs-directory=.

#+begin_src emacs-lisp
(setq straight-base-dir (init--state-file))
#+end_src

Bootstrap straight:

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

** use-package
#+begin_src emacs-lisp
  (straight-use-package 'use-package)
  (straight-use-package 'diminish)
  (eval-when-compile
    (require 'use-package))

  (setq use-package-hook-name-suffix nil
        use-package-always-defer t
        use-package-always-ensure t)

  (if init-file-debug
      (setq use-package-verbose t
            use-package-expand-minimally nil
            use-package-compute-statistics t)
    (setq use-package-verbose nil
          use-package-expand-minimally t))

  (use-package straight
    :straight nil
    :ensure nil
    :custom
    (straight-use-package-by-default t))
#+end_src

* Performance Optimizations

** Auto Mode Case Fold

By default, Emacs will search =auto-mode-alist= twice; first, looking for an exact match, then again trying doing a case-insensitive search. We are disabling that second pass:

#+begin_src emacs-lisp
(use-package emacs
  :straight nil
  :ensure nil
  :custom
  (auto-mode-case-fold nil))
#+end_src

** Bidirectional Editing

I don't write in any languages that need right-to-left support, so I can go ahead and disable to parts of Emacs that support it:

#+begin_src emacs-lisp
(use-package emacs
  :straight nil
  :ensure nil
  :init
  (setq bidi-inhibit-bpa t)
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right))
#+end_src
 
** JIT

#+begin_src emacs-lisp
(use-package emacs
  :straight nil
  :ensure nil
  (setq jit-lock-defer-time 0))
#+end_src

** GCMH

#+begin_src emacs-lisp
(use-package gcmh
  :diminish gcmh-mode
  :hook
  (after-init-hook . gcmh-mode)
  :custom
  (gcmh-verbose init-file-debug))
#+end_src

** VLF

#+begin_src emacs-lisp
(use-package vlf
  :hook
  ;; This sets-up all the autoloads and hooks
  (after-init-hook . (lambda ()
                       (require 'vlf-setup))))
#+end_src

