.config/emacs/init.el
;;; init.el --- Initialization -*- lexical-binding: t -*-
;;;
;;; Commentary:
;;;
;;;
;;; Code:

(require 'xdg)
(require 'seq)

(defun init--parts-to-path (&rest args)
  (seq-reduce (lambda (acc part)
                (expand-file-name part acc))
              args
              default-directory))

(defun init--state-file (&rest args)
  (apply #'init--parts-to-path (xdg-state-home) "emacs" args))

(defun init--cache-file (&rest args)
  (apply #'init--parts-to-path (xdg-cache-home) "emacs" args))

(defconst IS-MAC     (eq system-type 'darwin))
(defconst IS-LINUX   (eq system-type 'gnu/linux))
(defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
(defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))
(defconst IS-WSL     (and IS-LINUX
                          (string-match-p "Microsoft"
                                          (shell-command-to-string "uname -a"))))

(setq straight-base-dir (init--state-file))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(straight-use-package 'diminish)
(eval-when-compile
  (require 'use-package))

(setq use-package-hook-name-suffix nil
      use-package-always-defer t
      use-package-always-ensure t)

(if init-file-debug
    (setq use-package-verbose t
          use-package-expand-minimally nil
          use-package-compute-statistics t)
  (setq use-package-verbose nil
        use-package-expand-minimally t))

(use-package straight
  :straight nil
  :ensure nil
  :custom
  (straight-use-package-by-default t))

(use-package emacs
  :straight nil
  :ensure nil
  :custom
  (auto-mode-case-fold nil))

(use-package emacs
  :straight nil
  :ensure nil
  :init
  (setq bidi-inhibit-bpa t)
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right))

(use-package emacs
  :straight nil
  :ensure nil
  :init
  (setq jit-lock-defer-time 0))

(use-package gcmh
  :diminish gcmh-mode
  :hook
  (after-init-hook . gcmh-mode)
  :custom
  (gcmh-verbose init-file-debug))

(use-package vlf
  :hook
  ;; This sets-up all the autoloads and hooks
  (after-init-hook . (lambda ()
                       (require 'vlf-setup))))

(use-package emacs
  :custom
