Emacs.org
* General Settings

#+begin_src emacs-lisp
(use-package emacs
  :custom
  (user-full-name    "Jake Shilling")
  (user-mail-address "shilling.jake@gmail.com")
  (use-short-answers  t)
  (ring-bell-function #'ignore)

  (delete-by-moving-to-trash nil)

  (kill-ring-max 120)
  (kill-do-not-save-duplicates t)

  (minibuffer-prompt-properties
   '(read-only t intangible t cursor-intangible t face minibuffer-prompt))

  (vc-follow-symlinks t)
  ;; Don't warn because VLF will
  (large-file-warning-threshold nil)

  (save-interprogram-paste-before-kill t)
  (mouse-yank-at-point t)

  (require-final-newline t)

  (read-extended-command-predicate #'command-completion-default-include-p)
  (text-mode-ispell-word-completion nil)

  (sentence-end-double-space nil)

  (ecomplete-database-file          (init--cache-file "ecomplete-database.el"))

  (ede-project-placeholder-cache-file (init--cache-file "ede-projects.el"))
  (erc-dcc-get-default-directory    (init--cache-file "erc/dcc/"))
  (erc-log-channels-directory       (init--cache-file "erc/log-channels/"))
  (erc-startup-file-list            (list (init--state-file "erc/startup.el") (init--state-file "erc/startup") ".ercrc.el" ".ercrc"))
  (eudc-options-file                (init--state-file "eudc-options.el"))
  (eww-bookmarks-directory          (init--cache-file "eww/"))
  (filesets-menu-cache-file         (init--cache-file "filesets-menu-cache.el"))
  (gamegrid-user-score-file-directory (init--cache-file "gamegrid-user-score/"))
  (gnus-dribble-directory           (init--cache-file "gnus/dribble/"))
  (gnus-init-file                   (init--state-file "gnus/init.el"))
  ;; Gnus hardcodes newsrc.eld to be based on gnus-startup-file.
  (gnus-startup-file                (init--state-file "gnus/newsrc"))
  (ido-save-directory-list-file     (init--cache-file "ido-save-directory-list.el"))
  (ielm-history-file-name           (init--cache-file "ielm-history.eld"))
  (image-dired-db-file              (init--cache-file "image-dired/db.el"))
  (image-dired-dir                  (init--cache-file "image-dired/"))
  (image-dired-gallery-dir          (init--cache-file "image-dired/gallery/"))
  (image-dired-temp-image-file      (init--cache-file "image-dired/temp-image"))
  (image-dired-temp-rotate-image-file (init--cache-file "image-dired/temp-rotate-image"))
  (Info-saved-history-file          (init--cache-file "info-saved-history.eld"))
  (kkc-init-file-name               (init--cache-file "kkc-init.el"))
  (multisession-directory           (init--cache-file "multisession/"))
  (newsticker-cache-filename        (init--cache-file "newsticker/cache.el"))
  (newsticker-dir                   (init--cache-file "newsticker/data/"))
  (nsm-settings-file                (init--cache-file "nsm-settings.el"))
  (org-clock-persist-file           (init--cache-file "org/clock-persist.el"))
  (org-id-locations-file            (init--cache-file "org/id-locations.el"))
  (org-persist-directory            (init--cache-file "org/persist/"))
  (org-publish-timestamp-directory  (init--cache-file "org/timestamps/"))
  (persist--directory-location      (init--cache-file "persist/"))
  (project-list-file                (init--cache-file "project-list.el"))
  (quickurl-url-file                (init--cache-file "quickurl-url.el"))
  (rcirc-log-directory              (init--cache-file "rcirc-log/"))
  (recentf-save-file                (init--cache-file "recentf-save.el"))
  (remember-data-directory          (init--cache-file "remember/data.d/"))
  (remember-data-file               (init--cache-file "remember/data"))
  (save-place-file                  (init--cache-file "save-place.el"))
  (savehist-file                    (init--cache-file "savehist.el"))
  (semanticdb-default-save-directory (init--cache-file "semantic/"))
  (shadow-info-file                 (init--cache-file "shadow/info.el"))
  (shadow-todo-file                 (init--cache-file "shadow/todo.el"))
  (shared-game-score-directory      (init--cache-file "shared-game-score/"))
  (srecode-map-save-file            (init--cache-file "srecode-map.el"))
  (timeclock-file                   (init--cache-file "timeclock"))
  (tramp-auto-save-directory        (init--cache-file "tramp/auto-save/"))
  (tramp-persistency-file-name      (init--cache-file "tramp/persistency.el"))
  (type-break-file-name             (init--cache-file "type-break.el"))
  (url-cache-directory              (init--cache-file "url/cache/"))
  (url-configuration-directory      (init--cache-file "url/"))
  (url-cookie-file                  (init--cache-file "url/cookies.el"))
  (url-history-file                 (init--cache-file "url/history.el"))

  :init
  ;; (startup-redirect-eln-cache (init--cache-file "eln-cache"))
  (setq native-comp-jit-compilation nil)
  (setq custom-file nil)
  

  (let ((encoding (if IS-WINDOWS
                      'utf-8-dos
                    'utf-8-unix)))
    (cl-loop for fn in '(set-default-coding-systems
                         prefer-coding-system
                         set-terminal-coding-system
                         set-keyboard-coding-system
                         set-buffer-file-coding-system
                         set-selection-coding-system)
             do (apply fn (list encoding))))
  (set-language-environment "English")

  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)

  (when IS-WSL
    ;; WSLg breaks copy-paste from Emacs into Windows
    ;; see: https://www.lukas-barth.net/blog/emacs-wsl-copy-clipboard/
    (setq select-active-regions nil
          select-enable-clipboard 't
          select-enable-primary nil
          interprogram-cut-function #'gui-select-text)))
#+end_src

* Auto Save

#+begin_src emacs-lisp
(use-package emacs
  :straight nil
  :custom
  (auto-save-default  t)
  (auto-save-timeout  20)
  (auto-savye-interval 200)
  (auto-save-list-file-prefix (init--cache-file "auto-save-list" ".saves-")))
#+end_src

* Desktop Save Mode

#+begin_src emacs-lisp
(use-package desktop
  :straight nil
  :ensure nil
  :custom
  (desktop-path (init--cache-file "desktop/")))
#+end_src

* Diary

#+begin_src emacs-lisp
(use-package diary-lib
  :straight nil
  :ensure nil
  :custom
  (diary-file (init--cache-file "diary")))
#+end_src

* Backups

#+begin_src emacs-lisp
(use-package emacs
  :straight nil
  :custom
  (make-backup-files    t)
  (vc-make-backup-files nil)
  (backup-by-copying    t)
  (version-control      t)
  (kept-old-versions    6)
  (kept-new-versions    9))
#+end_src

* Calc

#+begin_src emacs-lisp
(use-package calc
  :straight nil
  :ensure nil
  :custom
  (calc-settings-file (init--state-file "calc-settings.el")))
#+end_src

* Abbrev

#+begin_src emacs-lisp
(use-package abbrev
  :straight nil
  :ensure nil
  :custom
  (abbrev-file-name (init--state-file "abbrev.el")))
#+end_src

* Auto Insert

#+begin_src emacs-lisp
(use-package autoinsert
  :custom
  (auto-insert-directory (init--state-file "auto-insert/")))
#+end_src

* Bookmarks

#+begin_src emacs-lisp
(use-package bookmark
  :custom
  (bookmark-default-file (init--cache-file "bookmark-default.el")))
#+end_src

