Emacs.org
* Eshell

#+begin_src emacs-lisp
(use-package eshell
  :custom
  (eshell-aliases-file (init--state-file "eshell" "aliases"))
  (eshell-directory-name (init--cache-file "eshell"))
  (eshell-login-script (init--state-file "eshell" "login"))
  (eshell-rc-script (init--state-file "eshell" "rc"))
  (eshell-history-file-name (init--cache-file "eshell" "history"))
  (eshell-modules-list '(eshell-alias
                         eshell-banner
                         eshell-cmpl
                         eshell-dirs
                         eshell-elecslash
                         eshell-extpipe
                         eshell-glob
                         eshell-hist
                         eshell-ls
                         eshell-prompt
                         eshell-script
                         eshell-smart
                         eshell-tramp
                         eshell-unix
                         eshell-xtra))
  (eshell-visual-commands '("pnpm"
                            "yarn"
                            "npx"
                            "flatpak"
                            "docker"
                            "docker-compose"
                            "devcontainer"
                            "guix"
                            "terraform"))
  (eshell-scroll-to-bottom-on-input 'all)
  (eshell-scroll-to-bottom-on-output'all)
  (eshell-kill-processes-on-exit t)
  (eshell-hist-ignoredups t)
  (eshell-glob-case-insensitive t)
  (eshell-error-if-no-glob t)
  :hook
  (eshell-mode-hook . (lambda ()
                        (setenv "TERM" "xterm-256color"))))
#+end_src
* EAT
#+begin_src emacs-lisp
(use-package eat
  :straight '(eat :type git
                  :host codeberg
                  :repo "akib/emacs-eat"
                  :files ("*.el" ("term" "term/*.el") "*.texi"
                          "*.ti" ("terminfo/e" "terminfo/e/*")
                          ("terminfo/65" "terminfo/65/*")
                          ("integration" "integration/*")
                          (:exclude ".dir-locals.el" "*-tests.el")))
  :hook
  (eshell-load-hook . eat-eshell-mode)
  (eshell-load-hook . eat-eshell-visual-command-mode))
#+end_src

* Eshell Syntax Highlighting

#+begin_src emacs-lisp
(use-package eshell-syntax-highlighting
  :hook
  (eshell-mode-hook . eshell-syntax-highlighting-mode))
#+end_src

* Unsorted
* So Long
#+begin_src emacs-lisp
(use-package so-long
  :diminish global-so-long-mode
  :hook
  (after-init-hook . global-so-long-mode))
#+end_src

* Recentf

#+begin_src emacs-lisp
(use-package recentf
  :diminish recentf-mode
  :custom
  (recentf-max-menu-items 50)
  (recentf-max-saved-items 50)
  (recentf-auto-cleanup 300)
  :hook
  (after-init-hook recentf-mode))
#+end_src

* Save History

#+begin_src emacs-lisp
;; https://emacs.stackexchange.com/questions/4187/strip-text-properties-in-savehist
(defun unpropertize-kill-ring ()
  "Remove properties from `kill-ring'."
  (setq kill-ring (mapcar 'substring-no-properties kill-ring)))
(add-hook 'kill-emacs-hook 'unpropertize-kill-ring)

(use-package savehist
  :diminish savehist-mode
  :custom
  (savehist-additional-variables '(kill-ring
                                   command-history
                                   set-variable-value-history
                                   query-replace-history
                                   read-expression-history
                                   minibuffer-history
                                   read-char-history
                                   face-name-history
                                   bookmark-history
                                   file-name-history))
  :hook
  (after-init-mode . savehist-mode))
#+end_src
* Save Place
#+begin_src emacs-lisp
(use-package saveplace
  :diminish save-place-mode
  :custom
  (save-place-forget-unreadable-files t)
  :hook
  (after-init-hook . save-place-mode))
#+end_src

* Appearance

#+begin_src emacs-lisp
(use-package emacs
  :init
  (set-default 'cursor-type '(bar . 1))
  (setq-default cursor-in-non-selected-windows nil)
  (setq bookmark-set-fringe-mark nil)
  (set-frame-parameter (selected-frame) 'internal-border-width 8)
  (setq window-divider-default-right-width 8)
  :hook
  (after-init-hook . window-divider-mode))
#+end_src

* Menu Bar

#+begin_src emacs-lisp
(use-package menu-bar
  :straight nil
  :ensure nil
  :config
  (menu-bar-mode 0))
#+end_src

* Tool Bar

#+begin_src emacs-lisp
(use-package tool-bar
  :straight nil
  :ensure nil
  :config
  (tool-bar-mode 0))
#+end_src

* Scroll Bar

#+begin_src emacs-lisp
(use-package scroll-bar
  :straight nil
  :ensure nil
  :config
  (scroll-bar-mode 0))
#+end_src

* Fringe

#+begin_src emacs-lisp
(use-package fringe
  :straight nil
  :ensure nil
  :config
  (set-fringe-mode 8))
#+end_src

* Fontset

#+begin_src emacs-lisp
(use-package fontset
  :straight nil
  :ensure nil
  :init
  (setq use-default-font-for-symbols nil)
  :config
  (set-fontset-font t 'symbol "Noto Emoji" nil 'append)
  (set-fontset-font t 'unicode "Noto Emoji" nil 'append)
  (set-fontset-font "fontset-default" nil
                    (font-spec :name "Noto Emoji")))
#+end_src

* Fontaine

#+begin_src emacs-lisp
(use-package fontaine
  :after fontset
  :config
  (setq fontaine-current-preset t
        fontaine-presets
        '((t
           :default-family "Iosevka"
           :default-height 16
           :fixed-pitch-family "Iosevka"
           :fixed-pitch-height 1.0
           :variable-pitch-family "Iosevka Etoile"
           :variable-pitch-height 1.0
           :variable-pitch-weight regular)
          (regular)
          (large :default-weight semilight
                 :default-height ,(+ 11 40)
                 :bold-weight extrabold)))
  :hook
  (after-init-hook . 'fontaine-mode))
#+end_src

