.config/emacs/init.el
  :bind ;; C-c bindings (mode-specific-map)
  (("C-c h" . consult-history)
   ("C-c m" . consult-mode-command)
   ("C-c k" . consult-kmacro)
   ;; C-x bindings (ctl-x-map)
   ("C-x r" . consult-recent-file)
   ("C-x M-:" . consult-complex-command)
   ("C-x b" . consult-buffer)
   ("C-x 4 b" . consult-buffer-other-window)
   ("C-x 5 b" . consult-buffer-other-frame)
   ("C-x p b" . consult-project-buffer)
   ;; Custom M-# bindings for fast register access
   ("M-#" . consult-register-load)
   ("M-'" . consult-register-store)
   ("C-M-#" . consult-register)
   ;; Other custom bindings
   ("M-y" . consult-yank-pop)
   ;; M-g bindings (goto-map)
   ("M-g e" . consult-compile-error)
   ("M-g f" . consult-flymake)
   ("M-g g" . consult-goto-line)
   ("M-g M-g" . consult-goto-line)
   ("M-g o" . consult-outline)
   ("M-g m" . consult-mark)
   ("M-g k" . consult-global-mark)
   ;; M-s bindings (search-map)
   ("M-s d" . consult-fd)
   ("M-s D" . consult-locate)
   ("M-s g" . consult-ripgrep)
   ("M-s G" . consult-git-grep)
   ("M-s r" . consult-ripgrep)
   ("M-s l" . consult-line)
   ("M-s L" . consult-line-multi)
   ("M-s k" . consult-keep-lines)
   ("M-s u" . consult-focus-lines)
   ;; Isearch integration
   ("M-s e" . consult-isearch-history)
   :map isearch-mode-map
   ("M-e" . consult-isearch-history)
   ("M-s e" . consult-isearch-history)
   ("M-s l" . consult-line)
   ("M-s L" . consult-line-multi)
   ;; Minibuffer history
   :map minibuffer-local-map
   ("M-s" . consult-history)
   ("M-r" . consult-history))

  :hook (completion-list-mode-hook . consult-preview-at-point-mode)

  :config
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  (advice-add #'register-preview :override #'consult-register-window))

(use-package consult-imenu
  :straight nil
  :ensure nil
  :bind
  ("M-g i" . consult-imenu)
  ("M-g I" . consult-imenu-multi))

(use-package consult-dir
  :bind (("C-x C-d" . consult-dir)
         :map minibuffer-local-completion-map
         ("C-x C-d" . consult-dir)
         ("C-x C-j" . consult-dir-jump-file)))

(use-package minibuffer
  :straight nil
  :ensure nil
  :bind
  ("C-M-i" . completion-at-point))

(use-package hippie-exp
  :bind
  ("M-/" . hippie-expand))

(use-package yasnippet
  :diminish yas-minor-mode
  :hook
  (yas-minor-mode-hook . (lambda ()
                           (setq-local hippie-expand-try-functions-list
                                       (cons #'yas-hippie-try-expand hippie-expand-try-functions-list)))))

(use-package corfu
  :diminish global-corfu-mode
  :custom
  (corfu-auto t)
  (corfu-quite-no-match 'separator)
  :hook
  (after-init-hook . global-corfu-mode))

(use-package corfu-history
  :straight nil
  :ensure nil
  :diminish corfu-history-mode
  :hook
  (corfu-mode-hook . corfu-history-mode))

(use-package corfu-info
  :straight nil
  :ensure nil
  :defines corfu-mode-map
  :bind
  (:map corfu-mode-map
        ("M-g" . corfu-info-location)
        ("M-h" . corfu-info-documentation)))

(use-package corfu-popupinfo
  :straight nil
  :ensure nil
  :diminish corfu-popupinfo-mode
  :hook
  (corfu-mode-hook . corfu-popupinfo-mode))

(use-package embark
  :autoload embark-prefix-help-command
  :bind
  (("C-." . embark-act)
   ("C-;". embark-dwim)
   ("C-h B" . embark-become))
  :init
  (setq prefix-help-command #'embark-prefix-help-command))

(use-package embark-consult
  :hook
  (embark-collect-mode-hook . consult-preview-at-point-mode))

(use-package abbrev
  :straight nil
  :ensure nil
  :custom
  (abbrev-file-name (init--state-file "abbrev.el")))

(use-package autoinsert
  :custom
  (auto-insert-directory (expand-file-name "inserts" user-emacs-directory))
  :hook
  (after-init-hook . auto-insert-mode))

(use-package envrc
  :diminish (envrc-global-mode envrc-mode)
  :hook (after-init-hook . envrc-global-mode))

(use-package delsel
  :diminish delete-selection-mode
  :hook (after-init-hook . delete-selection-mode))

(use-package autorevert
  :diminish global-auto-revert-mode
  :custom
  (global-auto-revert-non-file-buffers t)
  :hook (after-init-hook . global-auto-revert-mode))

(use-package flyspell
  :diminish (flyspell-prog-mode flyspell-mode)
  :hook
  (prog-mode-hook . flyspell-prog-mode)
  (text-mode-hook . flyspell-mode))

(use-package multiple-cursors
  :commands mc/sort-regions
  :custom
  (mc/list-file (init--cache-file ".mc-lists.el"))
  :bind
  ("C-S-c C-S-c" . mc/edit-lines)
  ("C->" . mc/mark-next-like-this)
  ("C-<" . mc/mark-previous-like-this)
  ("C-c C-<" . mc/mark-all-like-this))

(use-package subword
  :diminish subword-mode
  :hook
  (prog-mode-hook . subword-mode))

(use-package wgrep
  :hook
  (grep-setup-hook . 'wgrep-setup))

(use-package org
  :custom
  (org-M-RET-may-split-line '((default . nil)))
  (org-insert-heading-respect-content t)
  (org-adapt-indentation nil)
  (org-startup-indented nil)
  (org-ellipsis "⤵")
  (org-hide-emphasis-markers t)
  (org-log-into-drawer t)
  (org-default-notes-file (concat org-directory "/todo.org")))

(use-package org-src
  :straight nil
  :ensure nil
  :custom
  (org-edit-src-content-indentation 0))

(use-package org-refile
  :straight nil
  :ensure nil
  :custom
  (org-outline-path-complete-in-steps nil)
  (org-refile-use-outline-path 'full-file-path)
  (org-refile-allow-creating-parent-nodes 'confirm)
  (org-refile-targets `((nil . (:maxlevel . 3))
                        (org-agenda-files . (:maxlevel . 3)))))

(use-package org-id
  :straight nil
  :ensure nil
  :custom
  (org-id-locations-file (concat (xdg-cache-home) "/emacs/org-id-locations")))

(use-package org-capture
  :straight nil
  :ensure nil
  :bind
  (:map mode-specific-map
        ("c" . org-capture)))

(use-package ol-notmuch
  :after notmuch)

(use-package org-modern
  :custom
  (org-modern-todo nil)
  (org-modern-timestamp nil)
  (org-modern-statistics nil)
  (org-modern-tag nil)
  (org-modern-priority nil)
  (org-modern-hide-stars nil)
  (org-hide-leading-stars t)
  :hook
  (after-init-hook . global-org-modern-mode))

(use-package olivetti
  :hook
  (org-mode-hook . olivetti-mode))

(let*
