.config/emacs/init.el
    ((init-org-super-agenda-config
      `((org-super-agenda-unmatched-name 'none)
        (org-super-agenda-unmatched-order 5)
        (org-super-agenda-header-separator "\n")
        (org-super-agenda-groups
         `((:name "Clocked today"
                  :log t
                  :order 100)
           (:name none
                  :todo ("IDEA")
                  :order 1)
           (:name none
                  :todo ("PROJ")
                  :order 2)
           (:name none
                  :todo ,org-done-keywords-for-agenda
                  :order 10)))))
     (init-org-agenda-custom-commands
      `(((kbd "C-d") "Agenda for the day"
         ((agenda
           ""
           ((org-agenda-span 1)
            (org-agenda-scheduled-leaders '("" "Sched.%2dx: "))
            (org-agenda-block-separator nil)
            (org-scheduled-past-days 0)
            ,@init-org-super-agenda-config
            (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
            (org-agenda-format-date "%A %-e %B %Y")
            (org-agenda-overriding-header "\nAgenda for the day\n")))
          (todo
           "NEXT"
           ((org-agenda-block-separator nil)
            (org-agenda-overriding-header "\nCurrent Tasks\n")))))
        (list
         (kbd "C-o") "Overview"
         ((agenda
           "*"
           ((org-agenda-scheduled-leaders '("" "Sched. %2dx:"))
            ,@init-org-super-agenda-config
            (org-agenda-block-separator nil)
            (org-agenda-span 14)
            (org-agenda-show-future-repeats nil)
            (org-agenda-skip-deadline-prewarning-if-scheduled t)
            (org-agenda-overriding-header "\nAgenda\n")))
          (agenda
           ""
           ((org-agenda-start-on-weekday nil)
            (org-agenda-start-day "+1d")
            (org-agenda-span 14)
            (org-agenda-show-all-dates nil)
            (org-agenda-time-grid nil)
            (org-agenda-show-future-repeats nil)
            (org-agenda-block-separator nil)
            (org-agenda-entry-types '(:deadline))
            (org-agenda-skip-function '(org-agenda-skip-entry-if 'done))
            (org-agenda-overriding-header "\nUpcoming deadlines (+14d)\n")))
          (alltodo
           ""
           ((org-agenda-block-separator nil)
            (org-agenda-skip-function '(or (org-agenda-skip-if nil '(scheduled))))
            ,@init-org-super-agenda-config
            (org-agenda-overriding-header "\nBacklog\n"))))))))
  (use-package org-agenda
    :straight nil
    :ensure nil
    :custom
    (org-agenda-custom-commands init-org-agenda-custom-commands)
    (org-agenda-tags-column 0)
    (org-agenda-sticky t)
    (org-agenda-block-separator ?-)
    (org-agenda-time-grid '((daily today require-timed)
                            (800 1000 1200 1400 1600 1800 2000)
                            " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
    (org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────")
    (org-agenda-start-with-log-mode t)
    (org-agenda-dim-blocked-tasks t)
    (org-agenda-skip-scheduled-if-done nil)
    (org-agenda-skip-deadline-if-done nil)
    (org-agenda-compact-blocks nil)
    (org-agenda-log-mode-add-notes nil)
    (org-agenda-bulk-custom-functions
     '((?P (lambda nil
             (org-agenda-priority 'set)))))))

(use-package org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode))

(use-package helpful
  :bind
  (("C-h f" . helpful-callable)
   ("C-h v" . helpful-variable)
   ("C-h k" . helpful-key)))

(use-package devdocs
  :bind
  (("C-h D" . devdocs-lookup)))

(use-package pinentry
  :custom
  (epa-pinentry-mode 'loopback)
  :hook
  (after-init-hook . pinentry-start))

(use-package pass
  :commands pass)

(use-package auth-source-pass
  :hook
  (after-init-hook . auth-source-pass-enable))

(use-package which-key
  :diminish which-key-mode
  :hook
  (after-init-hook . which-key-mode))

(use-package tramp)

(use-package transient
  :custom
  (transient-history-file (init--cache-file "transient" "history.el")))

(use-package grep
  :autoload grep-apply-setting
  :config
  (grep-apply-setting
   'grep-command
   "rg -n -H --no-heading ")
  (grep-apply-setting
   'grep-find-command
   '("rg -n -H --no-heading -e '' $(git rev-parse --show-toplevel || pwd)" . 27)))

(use-package dired
  :straight nil
  :ensure nil
  :custom
  (dired-dwim-target t)
  (dired-hide-details-hide-symlink-targets nil)
  (dired-auto-revert-buffer #'dired-buffer-stale-p)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'top)
  (dired-create-destination-dirs 'ask)
  (dired-listing-switches "-lah -v --group-directories-first")
  :hook
  ((dired-mode-hook . dired-omit-mode)
   (dired-mode-hook . dired-hide-details-mode)))

(use-package diredfl
  :hook
  (after-init-hook . diredfl-global-mode))

(use-package proced
  :custom
  (proced-auto-update-flag t)
  (proced-auto-update-interval 1)
  (proced-enable-color-flag t))

(use-package ibuffer
  :bind
  (("C-x C-b" . ibuffer)))

(use-package diff-hl
  :diminish (diff-hl-mode diff-hl-dir-mode)
  :hook
  (magit-pre-refresh-hook . diff-hl-magit-pre-refresh)
  (magit-post-refresh-hook . diff-hl-magit-post-refresh)
  (prog-mode-hook . diff-hl-mode)
  (vc-dir-mode . diff-hl-dir-mode))

(use-package diff-hl-dired
  :straight nil
  :ensure nil
  :diminish diff-hl-dired-mode
  :hook (dired-mode-hook . diff-hl-dired-mode))

(use-package magit
  :bind ("C-x g" . magit-status))

(use-package forge
  :after magit)

(use-package magit-todos
  :after magit
  :commands magit-todos-list
  :config (magit-todos-mode +1))

(use-package project
  :custom
  (project-list-buffers #'project-list-buffers-ibuffer)
  (project-list-file (init--state-file "project")))

(use-package eldoc
  :diminish eldoc-mode
  :custom
  (eldoc-echo-area-use-multiline-p nil)
  (eldoc--echo-area-prefer-doc-buffer-p t))

(use-package prog-mode
  :straight nil
  :ensure nil
  :hook
  (prog-mode-hook . prettify-symbols-mode))

(use-package apheleia
  :diminish apheleia-mode
  :config
  (add-to-list 'apheleia-formatters
               '(prettier-astro . ("apheleia-npx" "prettier" "--stdin-filepath" filepath "--plugin=prettier-plugin-astro")))
  (add-to-list 'apheleia-mode-alist
               '(astro-mode . prettier-astro))

  :hook
  (after-init-hook . apheleia-global-mode))
