.config/emacs/init.el

(use-package smartparens
  :diminish smart-parens-mode
  :defines smartparens-mode-map
  :bind
  (:map smartparens-mode-map
        ("C-M-f" . sp-forward-sexp)
        ("C-M-b" . sp-backward-sexp)
        ("C-M-u" . sp-backward-up-sexp)
        ("C-M-d" . sp-down-sexp)
        ("C-M-p" . sp-backward-down-sexp)
        ("C-M-n" . sp-up-sexp)
        ("C-M-a" . sp-beginning-of-sexp)
        ("C-M-e" . sp-end-of-sexp)
        ("C-k"   . sp-kill-hybrid-sexp)
        ("C-)"   . sp-forward-slurp-sexp)
        ("C-("   . sp-backward-slurp-sexp)
        ("C-}"   . sp-forward-barf-sexp)
        ("C-{"   . sp-backward-barf-sexp)
        ("M-r"   . sp-raise-sexp)
        ("M-<up>" . sp-splice-sexp-killing-backward)
        ("M-<down>" . sp-splice-sexp-killing-forward)
        ("M-s"   . sp-splice-sexp)
        ("M-S"   . sp-split-sexp)
        ("M-J"   . sp-join-sexp))
  :config
  ;; load default configuration to setup other pairs
  (require 'smartparens-config)
  (diminish smartparens-strict-mode)
  (diminish smartparens-mode)
  :hook
  ((emacs-lisp-mode-hook . smartparens-strict-mode)
   (eval-expression-minibuffer-setup-hook . smartparens-mode)
   (ielm-mode-hook . smartparens-strict-mode)
   (lisp-mode-hook . smartparens-strict-mode)
   (lisp-data-mode-hook . smartparens-strict-mode)
   (scheme-mode-hook . smartparens-strict-mode)
   (geiser-repl-mode-hook . smartparens-strict-mode)
   (clojure-mode-hook . smartparens-strict-mode)
   (clojurec-mode-hook . smartparens-strict-mode)
   (clojurescope-mode-hook . smartparens-strict-mode)
   (cider-repl-mode-hook . smartparens-strict-mode)
   (prog-mode-hook . smartparens-mode)
   (org-mode-hook . smartparens-mode)
   (markdown-mode-hook . smartparens-mode)))

(use-package eglot
  :config
  (add-to-list 'eglot-server-programs
               '((js-json-mode json-mode json-ts-mode jsonc-mode)
                 .
                 ("npx" "vscode-json-languageserver" "--stdio")))

  (add-to-list 'eglot-server-programs
               '((yaml-ts-mode yaml-mode)
                 .
                 ("npx" "yaml-language-server" "--stdio")))

  (add-to-list 'eglot-server-programs
               '((dockerfile-mode dockerfile-ts-mode)
                 .
                 ("npx" "-p" "dockerfile-language-server-nodejs" "docker-langserver" "--stdio")))

  (add-to-list 'eglot-server-programs
               '((python-mode python-ts-mode)
                 .
                 ("basedpyright-langserver" "--stdio")))
  (add-to-list 'eglot-server-programs
               '(astro-mode
                 .
                 ("npx" "-p" "@astrojs/language-server" "astro-ls" "--stdio"
                  :initializationOptions
                  (:typescript (:tsdk "./node_modules/typescript/lib")))))
  :bind
  (:map eglot-mode-map
        ("C-c C-d" . eldoc-doc-buffer)))

(use-package eglot-booster
  :straight nil
  :ensure nil
  :after eglot
  :config (eglot-booster-mode))

(use-package consult-xref
  :straight nil
  :ensure nil
  :autoload consult-xref
  :custom
  (xref-show-xrefs-function #'consult-xref)
  (xref-show-definitions-function #'consult-xref))

(use-package flymake
  :diminish flymake-mode
  :hook
  (eglot-mode-hook . flymake-mode)
  (emacs-lisp-mode . flymake-mode)
  :bind
  (:map flymake-mode-map
        ("M-n" . flymake-goto-next-error)
        ("M-p" . flymake-goto-prev-error)))

(use-package nix-ts-mode
  :if (treesit-available-p)
  :mode "\\.nix\\'"
  :hook (nix-ts-mode-hook . eglot-ensure))

(use-package typescript-ts-mode
  :if (treesit-available-p)
  :mode (("\\.[m]?ts\\'" . typescript-ts-mode)
         ("\\.[m]?js\\'" . typescript-ts-mode)
         ("\\.[m]?tsx?\\'" . tsx-ts-mode)
         ("\\.[m]?jsx?\\'" . tsx-ts-mode))
  :interpreter "ts-node"
  :hook
  (typescript-ts-base-mode-hook . eglot-ensure))

(use-package python-ts-mode
  :if (treesit-available-p)
  :straight nil
  :ensure nil
  :mode "\\.py[iw]?\\'"
  :interpreter "python"
  :hook
  (python-ts-mode-hook . eglot-ensure))

(use-package pyvenv
  :hook
  ((python-ts-mode-hook . pyvenv-mode)
   (python-ts-mode-hook . pyvenv-tracking-mode)))

(use-package poetry
  :hook
  (python-ts-mode-hook . poetry-tracking-mode))

(use-package dockerfile-ts-mode
  :if (treesit-available-p)
  :mode "\\(?:Dockerfile\\(?:\\..*\\)?\\|\\.[Dd]ockerfile\\)\\'"
  :hook
  (dockerfile-ts-mode-hook . eglot-ensure))

(use-package haskell-mode
  :mode "\\.[l]?hs\\'"
  :interpreter "ghci"
  :init (require 'haskell-mode-autoloads)
  :hook
  (haskell-mode-hook . eglot-ensure))

(use-package haskell-cabal
  :straight nil
  :ensure nil
  :mode ("\\.cabal\\'" . haskell-cabal-mode))

(use-package graphql-ts-mode
  :mode ("\\.graphql\\'" "\\.gql\\'")
  :config
  (add-to-list 'apheleia-mode-alist
               '(graphql-ts-mode . prettier-graphql)))

(use-package terraform-mode
  :mode ("\\.tf\\'")
  :hook
  (terraform-mode-hook . eglot-ensure))

(use-package yaml-ts-mode
  :if (treesit-available-p)
  :mode ("\\.ya?ml\\'" . yaml-ts-mode))

;; TODO: Update this to use astro-ts-mode instead

(straight-use-package 'web-mode)
(require 'web-mode)
(define-derived-mode astro-mode web-mode "astro")
(add-to-list 'auto-mode-alist '(".*\\.astro\\'" . astro-mode))

;;; init.el ends here
